## Staging: lambda-api
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 4 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| update   | `aws_api_gateway_account.api_cloudwatch[0]`    |
|          | `aws_api_gateway_method_settings.all`          |
|          | `aws_api_gateway_method_settings.api_settings` |
|          | `aws_api_gateway_stage.api`                    |
| recreate | `aws_api_gateway_deployment.api`               |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_account.api_cloudwatch[0] will be updated in-place
  ~ resource "aws_api_gateway_account" "api_cloudwatch" {
      ~ cloudwatch_role_arn = "arn:aws:iam::239043911459:role/api-gateway-logs-role" -> "arn:aws:iam::239043911459:role/ApiGatewayCloudWatchRole"
        id                  = "api-gateway-account"
        # (3 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.api must be replaced
+/- resource "aws_api_gateway_deployment" "api" {
      ~ created_date  = "2024-05-06T19:12:50Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:239043911459:74i43aysii/" -> (known after apply)
      ~ id            = "yzyq1w" -> (known after apply)
      ~ invoke_url    = "https://74i43aysii.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = { # forces replacement
          ~ "redeployment" = "dddfec90556d3f2ca78529f841dfa6d92558c140" -> "a1ee6d5c96b186914de712b52a7a4456ced10450"
        }
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_method_settings.all will be updated in-place
  ~ resource "aws_api_gateway_method_settings" "all" {
        id          = "74i43aysii-v1-*/*"
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ logging_level                              = "INFO" -> "ERROR"
            # (9 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_method_settings.api_settings will be updated in-place
  ~ resource "aws_api_gateway_method_settings" "api_settings" {
        id          = "74i43aysii-v1-*/*"
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ logging_level                              = "INFO" -> "ERROR"
            # (9 unchanged attributes hidden)
        }
    }

  # aws_api_gateway_stage.api will be updated in-place
  ~ resource "aws_api_gateway_stage" "api" {
      ~ deployment_id         = "yzyq1w" -> (known after apply)
        id                    = "ags-74i43aysii-v1"
        tags                  = {}
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 4 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.alt_api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_domain_name.api_lambda"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_rest_api.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_api_gateway_stage.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_gateway_log_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.api_lambda_log_group[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.failed-login-count-5-minute-warning[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-1-error-1-minute-warning-salesforce-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.logs-10-error-5-minutes-critical-lambda-api[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecr"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.api_cloudwatch[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.ecr-user"]
WARN - plan.json - main - Missing Common Tags: ["aws_kinesis_firehose_delivery_stream.firehose-api-lambda-waf-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.api"]
WARN - plan.json - main - Missing Common Tags: ["aws_secretsmanager_secret.new-relic-license-key"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
